using LibraryMVVM_Application.Model;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LibraryMVVM_Application.ViewModel
{
    class MainVM
    {
        public List<Book> AllBooks = new List<Book>()
        {
            new Book("Дэниел Киз", "Таинственная история Билли Миллигана", 1, 1981, 1),
            new Book("Михаил Шолохов", "Судьба человека. Рассказы", 2, 1956, 2),
            new Book("Рик Риордан", "Перси Джексон и последнее пророчество", 3, 2009, 5),
            new Book("Эрих Ремарк", "Возлюби ближнего своего", 4, 1941, 6),
            new Book("Артур Хейли", "Аэропорт", 5, 1968, 8),
            new Book("Айн Рэнд", "Источник", 6, 1957, 9),
            new Book("Тихон Архимандрит", "Несвятые святые", 7, 2020, 11),
            new Book("Решад Гюнтекин", "Королек-птичка певчая", 8, 1922, 12),
            new Book("Кир Булычев", "Посёлок", 9, 1984, 14),
            new Book("Федор Достоевский", "Идиот", 10, 1869, 15),
            new Book("Ирвин Шоу", "Богач, бедняк", 11, 1969, 17),
            new Book("Арчибальд Кронин", "Цитадель", 12, 1939, 18),
            new Book("Генрик Сенкевич", "Камо грядеши", 13, 1896, 20),
            new Book("Джон Стейнбек", "К востоку от Эдема",  14, 1952, 21),
            new Book("Стивен Кинг", "Мизери",  15, 1987, 22)
        };

        public List<User> AllUsers = new List<User>()
        {
            new User(0, "Евгений", "Катышков", new List<Book>()
            {
                new Book("Эрих Ремарк", "Возлюби ближнего своего", 4, 1941, 1),
                new Book("Артур Хейли", "Аэропорт", 5, 1968, 1),
                new Book("Айн Рэнд", "Источник", 6, 1957, 1),
                new Book("Тихон Архимандрит", "Несвятые святые", 7, 2020, 1),
                new Book("Решад Гюнтекин", "Королек-птичка певчая", 8, 1922, 1),
            }),

            new User(1, "Андрей", "Филатов", new List<Book>()
            {
                new Book("Стивен Кинг", "Мизери",  15, 1987, 1)
            }),

            new User(2, "Артемий", "Исаев", new List<Book>()),

            new User(3, "Ярослав", "Шилов", new List<Book>()),

            new User(4, "Ева", "Фомичева", new List<Book>()
            {
                new Book("Ирвин Шоу", "Богач, бедняк", 11, 1969, 1),
                new Book("Арчибальд Кронин", "Цитадель", 12, 1939, 1),
                new Book("Генрик Сенкевич", "Камо грядеши", 13, 1896, 1),
            }),

            new User(5, "Кирилл", "Егоров", new List<Book>()),

            new User(6, "Агата", "Беляева", new List<Book>()
            {
                new Book("Решад Гюнтекин", "Королек-птичка певчая", 8, 1922, 1),
                new Book("Кир Булычев", "Посёлок", 9, 1984, 1),
                new Book("Федор Достоевский", "Идиот", 10, 1869, 1),
            }),

            new User(7, "Максим", "Николаев", new List<Book>()
            {
                new Book("Кир Булычев", "Посёлок", 9, 1984, 1),
                new Book("Федор Достоевский", "Идиот", 10, 1869, 1),
                new Book("Ирвин Шоу", "Богач, бедняк", 11, 1969, 1),
            }),

            new User(8, "Дарья", "Жарова", new List<Book>()),

            new User(9, "Евгения", "Макарова", new List<Book>()
            {
                new Book("Генрик Сенкевич", "Камо грядеши", 13, 1896, 1),
                new Book("Джон Стейнбек", "К востоку от Эдема",  14, 1952, 1),
                new Book("Стивен Кинг", "Мизери",  15, 1987, 1)
            }),

            new User(10, "Виталий", "Петров", new List<Book>()),
        };
    }
}
